; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v2 ?v7)
             (pred_8 ?v10 ?v9)
             (pred_12 ?v2 ?v9)
             (pred_4 ?v4 ?v2 )
	     (pred_1 ?v2)
             (pred_2 ?v5)
             (pred_3 ?v10)
             (pred_6 ?v9)
             (pred_7 ?v2)
             (pred_10 ?v10)
             (pred_5 ?v2)
             (pred_11 ))



(:action op_5
:parameters (?v11 ?v6 ?v3 ?v8)
:precondition (and (pred_2 ?v11) (pred_2 ?v6) (pred_3 ?v3) (pred_6 ?v8)
          (pred_9 ?v11 ?v6) (pred_8 ?v3 ?v8)
                   (pred_12 ?v6 ?v8) (pred_1 ?v11) 
                   (pred_7 ?v6) (pred_10 ?v3))
:effect (and  (pred_5 ?v6) (not (pred_7 ?v6))))


(:action op_2
:parameters (?v11 ?v13)
:precondition (and (pred_2 ?v11) (pred_2 ?v13)
               (pred_1 ?v11) (pred_9 ?v11 ?v13) (pred_5 ?v13))
:effect (and (pred_1 ?v13) (not (pred_1 ?v11))))

(:action op_4
:parameters (?v11 ?v3)
:precondition (and (pred_2 ?v11) (pred_3 ?v3) 
                  (pred_1 ?v11) (pred_4 ?v3 ?v11) (pred_11 ))
:effect (and (pred_10 ?v3)
   (not (pred_4 ?v3 ?v11)) (not (pred_11 ))))


(:action op_3
:parameters (?v11 ?v1 ?v12)
:precondition (and (pred_2 ?v11) (pred_3 ?v1) (pred_3 ?v12)
                  (pred_1 ?v11) (pred_10 ?v12) (pred_4 ?v1 ?v11))
:effect (and (pred_10 ?v1) (pred_4 ?v12 ?v11)
        (not (pred_10 ?v12)) (not (pred_4 ?v1 ?v11))))

(:action op_1
:parameters (?v11 ?v3)
:precondition (and (pred_2 ?v11) (pred_3 ?v3) 
                  (pred_1 ?v11) (pred_10 ?v3))
:effect (and (pred_11 ) (pred_4 ?v3 ?v11) (not (pred_10 ?v3)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_13 obj_20 obj_07 obj_21 obj_03 obj_12 obj_15 obj_04 obj_18 obj_22 obj_14 obj_02 obj_10 obj_11 obj_09
    obj_17 obj_06 obj_05
    obj_19 obj_01 obj_16
    )

    (:init
       (pred_11)

       (pred_2 obj_08)
       (pred_2 obj_13)
       (pred_2 obj_20)
       (pred_2 obj_07)
       (pred_2 obj_21)
       (pred_2 obj_03)
       (pred_2 obj_12)
       (pred_2 obj_15)
       (pred_2 obj_04)
       (pred_2 obj_18)
       (pred_2 obj_22)
       (pred_2 obj_14)
       (pred_2 obj_02)
       (pred_2 obj_10)
       (pred_2 obj_11)
       (pred_2 obj_09)
       (pred_6 obj_17)
       (pred_6 obj_06)
       (pred_6 obj_05)
       (pred_3 obj_19)
       (pred_3 obj_01)
       (pred_3 obj_16)

       (pred_9 obj_08 obj_21)
       (pred_9 obj_08 obj_13)
       (pred_9 obj_13 obj_03)
       (pred_9 obj_13 obj_20)
       (pred_9 obj_13 obj_08)
       (pred_9 obj_20 obj_12)
       (pred_9 obj_20 obj_07)
       (pred_9 obj_20 obj_13)
       (pred_9 obj_07 obj_15)
       (pred_9 obj_07 obj_20)
       (pred_9 obj_21 obj_04)
       (pred_9 obj_21 obj_03)
       (pred_9 obj_21 obj_08)
       (pred_9 obj_03 obj_18)
       (pred_9 obj_03 obj_12)
       (pred_9 obj_03 obj_13)
       (pred_9 obj_03 obj_21)
       (pred_9 obj_12 obj_22)
       (pred_9 obj_12 obj_15)
       (pred_9 obj_12 obj_20)
       (pred_9 obj_12 obj_03)
       (pred_9 obj_15 obj_14)
       (pred_9 obj_15 obj_07)
       (pred_9 obj_15 obj_12)
       (pred_9 obj_04 obj_02)
       (pred_9 obj_04 obj_18)
       (pred_9 obj_04 obj_21)
       (pred_9 obj_18 obj_10)
       (pred_9 obj_18 obj_22)
       (pred_9 obj_18 obj_03)
       (pred_9 obj_18 obj_04)
       (pred_9 obj_22 obj_11)
       (pred_9 obj_22 obj_14)
       (pred_9 obj_22 obj_12)
       (pred_9 obj_22 obj_18)
       (pred_9 obj_14 obj_09)
       (pred_9 obj_14 obj_15)
       (pred_9 obj_14 obj_22)
       (pred_9 obj_02 obj_10)
       (pred_9 obj_02 obj_04)
       (pred_9 obj_10 obj_11)
       (pred_9 obj_10 obj_18)
       (pred_9 obj_10 obj_02)
       (pred_9 obj_11 obj_09)
       (pred_9 obj_11 obj_22)
       (pred_9 obj_11 obj_10)
       (pred_9 obj_09 obj_14)
       (pred_9 obj_09 obj_11)
       (pred_7 obj_10)
       (pred_7 obj_22)
       (pred_7 obj_15)
       (pred_12  obj_10 obj_17)
       (pred_12  obj_22 obj_06)
       (pred_12  obj_15 obj_05)
       (pred_5 obj_08)
       (pred_5 obj_13)
       (pred_5 obj_20)
       (pred_5 obj_07)
       (pred_5 obj_21)
       (pred_5 obj_03)
       (pred_5 obj_12)
       (pred_5 obj_04)
       (pred_5 obj_18)
       (pred_5 obj_14)
       (pred_5 obj_02)
       (pred_5 obj_11)
       (pred_5 obj_09)

       (pred_8  obj_19 obj_17)
       (pred_8  obj_01 obj_06)
       (pred_8  obj_16 obj_05)
       (pred_4 obj_19 obj_09)
       (pred_4 obj_01 obj_07)
       (pred_4 obj_16 obj_03)
       (pred_1 obj_04)
    )

    (:goal (and
       (pred_4 obj_16 obj_07)
    ))
(:constraints
  (always (not (pred_1 obj_21)))
)
)

; plan
1. (op_2 obj_04 obj_18)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_18)
   goals met: 0 of 1
2. (op_2 obj_18 obj_03)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_03)
   goals met: 0 of 1
3. (op_4 obj_03 obj_16)
   deleted: (pred_4 obj_16 obj_03) (pred_11)
   added: (pred_10 obj_16)
   goals met: 0 of 1
4. (op_2 obj_03 obj_13)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_13)
   goals met: 0 of 1
5. (op_2 obj_13 obj_20)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_20)
   goals met: 0 of 1
6. (op_2 obj_20 obj_07)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_07)
   goals met: 0 of 1
7. (op_3 obj_07 obj_01 obj_16)
   deleted: (pred_10 obj_16) (pred_4 obj_01 obj_07)
   added: (pred_10 obj_01) (pred_4 obj_16 obj_07)
   goals met: 1 of 1
